// eslint-disable-next-line
export default {
  // U88 ASIA Rule
  agreement_title: 'JP88.asia 法定通貨の取引規約',
  agreement_rule: '法定通貨取引の基本原則：',
  agreement_rule_list: [
    'これらの規則は、発行日から正式に実施され、随時改訂または改善されます。改訂または改善された新しい規則は、発行日から有効になります。',
    '本規則及び改訂または改善された規則の内容に同意できない場合は、当社のサービスの使用を直ちに停止してください。',
    '当社のサービスを継続して利用する場合は、随時改訂または改善された内容を十分に理解し、承諾したものとみなし、自主的に拘束されます。',
  ],

  // Buy Rule
  agreement_buy_rule: '購入者が従うべき原則：',
  agreement_buy_rule_sub: '注文が作成された後、購入者は：',
  agreement_buy_rule_list: [
    '注文で指定された支払い時間内に支払いを完了し、「支払い済み」をクリックします]',
    '本人実名で支払いをし、注文金額、および注文で指定された受取口座を使用して、注文の支払いをリアルタイムで完了してください',
    '注文の支払いにリアルタイムではない支払い方法を選択する場合は、事前に売却者の同意を得る必要があります',
    '支払いの注文には、備考欄に「仮想通貨、USDT」などの情報を入力しないでください',
    '購入者は注文後、プラットフォームの外でKYCを完了する必要がある場合は、売却者に積極的に連絡し、注文してから30分以内にKYCを完了してくださ',
    '注文が作成された後、売却者が受け取る合計金額は、注文詳細の金額と一致する必要があります。また、支払い中に追加費用が発生した場合は、購入者の負担となります',
  ],

  // Sell Rule
  agreement_sell_rule: '売却者が従うべき原則：',
  agreement_sell_rule_sub: '注文が作成された後、売却者は：',
  agreement_sell_rule_list: [
    'プラットフォームによって認定された受信アカウントを提供します',
    '購入者からの全額を受け取った後、注文で指定された時間内に完了します',
    '購入者の同意なしに、購入者/カスタマーサービスに注文のキャンセルを要求することはできません',
    '購入者の同意なしに、作成された注文価格に異議を申し立てることはできません',
  ],

  // User Rule
  user_rule: '利用者はマネーロンダリング防止の原則に従う必要があります：',
  user_rule_list: [
    '用戶應遵守平臺的《U88 ASIA 條款和條件》並嚴格照此履行相關義務',
    '利用者は、プラットフォームの《JP88.asia利用規約》を遵守し、その義務を厳格に遵守する必要があります',
    '利用者は、ユーザーIDとアカウントに関するプラットフォームの本人認証管理要件に厳密に従い、プラットフォームに表示される関連するアカウントが合法的に登録され、使用されていることを確認する必要があります',
    '利用者がプラットフォームのマネーロンダリング防止リスク管理の早期警告が起きた場合、利用者はプラットフォームのさらなるマネーロンダリング防止検証作業に積極的に協力し、関連するリスク管理証拠資料を積極的に提供して協力する必要があります(具体的な対策は、その時点のプラットフォームのリスク管理レビュー要件に基づきます)',
  ],

  // Table #1 Th
  table_1_th: ['#', '例外処理', '処理対策'],

  // Table #1 Td
  table_1_td_1: [
    '1',
    '注文が作成された後、購入者は自ら注文をキャンセルするか、支払いがタイムアウトしますと、システムは自動的に注文をキャンセルします。',
    '同じ日に4回に達しますと、システムは購入者の購入機能を制限します。2日間連続に起こしますと、システムは購入者のアカウントの一部の機能をさらに制限します。',
  ],
  table_1_td_2: [
    '2',
    '未払いの場合は、「支払い済み」をクリックしてください。',
    '売却者はこの注文のキャンセルを要求する権利があります。購入者がその日に2回苦情を申し立てられた場合、システムは購入者のアカウントの一部の機能を制限します。そのような苦情が1回の金額が80,000中国ドルを超えた場合、システムは直接に購入者のアカウントを48時間制限します。',
  ],
  table_1_td_3: [
    '3',
    '売却者が違反をせず、購入者が未支払いの場合、理由もなく「苦情」をクリック。',
    '売却者はこの注文のキャンセルを要求する権利があります。購入者がその日に2回苦情を申し立てられた場合、システムは購入者のアカウントの一部の機能を制限します。',
  ],
  table_1_td_4: [
    '4',
    '売却者の注文詳細ページに表示されている受取アカウントに従って支払いを行わなかった場合。',
    '売却者は注文のキャンセルを要求する権利があります。仮想通貨資産は売却者に返還され、購入者は間違った支払いの送金リスクを負います。',
  ],
  table_1_td_5: [
    '5',
    '未払いの場合は、まず「支払い済み」をクリックしてから支払いを行います。',
    '売却者は、取引を継続するか、払い戻し後に注文をキャンセルするかを選択する権利があります。1）売却者が取引の継続を選択した場合、売却者は全額の支払いを受け取ってから10分以内にリリースを完了する必要があります。2）売却者が注文のキャンセルを選択した場合、売却者は注文が上訴されてから２時間以内に払い戻しを完了し、仮想通貨資産を売却者に返却されます。 ',
  ],
  table_1_td_6: [
    '6',
    'プラットフォームアカウントの実名と一致する支払いアカウントを使用して支払いが行われておりません。',
    '売却者は取引を直接拒否する権利があり、売却者は支払いを受け取ってから48時間以内に返金処理を完了することができ、仮想通貨資産は売却者に返却されます。 (法人が認証された人の実名と一致するかどうかに関わらず)会社のアカウントを使用して支払いを行う場合、実名でない支払いとします。 購入者はこのような状況の苦情が2回を受けた場合、システムは購入者のアカウントの一部の機能を制限します。',
  ],
  table_1_td_7: [
    '7',
    '注文で指定された支払い時間内に支払います。（1）購入者がすべての支払いを完了し、注文が購入者自らキャンセルされたまたはシステムのタイムアウトによりキャンセルされた。（2）購入者が支払いの一部を完了したが、注文が購入者自らキャンセルされたまたはシステムのタイムアウトによりキャンセルされた。',
    '注文が購入者自らキャンセルされたまたはシステムのタイムアウトによりキャンセルされた場合、売却者は取引を継続するか、返金(注文のキャンセル)をするかの選択する権利があります。1.売却者が取引の継続を選択した場合、―売却者は通常のユーザーであり、注文はプラットフォームによって直接再開され、売却者は再開後10分以内に資産リリースを完了する必要があります。―売却者は広告主ユーザーであり、注文金額が80,000以下の場合、「注文を再開してリリース」を使用し、資産リリース操作を完了してください。注文金額が80,000を超える場合は、注文を再開してから10分以内に資産リリースを完了してください。2.売却者が注文のキャンセルを選択した場合、売却者はプラットフォームまたは購入者ユーザーからのフィードバックを受け取ってから60分以内に返金を完了する必要があります。 仮想通貨資産は売却者に返却されます。',
  ],
  table_1_td_8: [
    '8',
    '複数回の支払いが必要の上、すべての送金が完了されてない場合は、先に「支払い済み」をクリックして、支払いを続行します。',
    '1）事前に売却者と連絡を取り、売却者がその行動を許可し、売却者は注文を継続する必要があります。2）売却者の同意なしに、売却者は取引を継続するか、返金後に注文をキャンセルするかの選択をする権利があります。―売却者が取引の継続を選択した場合、売却者はすべての支払いを受け取ってから10分以内にリリースを完了する必要があります。―売却者が注文のキャンセルを選択した場合、売却者は支払いを受け取ってから30分以内に返金をして、仮想通貨資産は売却者に返却されます。',
  ],
  table_1_td_9: [
    '9',
    '支払金額は注文金額と一致しません。',
    '1）支払い金額が注文金額より多い場合、注文は成立し、売却者は支払いを受け取ってから30分以内に超過金額の分を返金します。2）支払い金額が注文金額より少ない場合、売却者は取引を継続するか、返金後に注文のキャンセルを要求するかの選択をする権利があります。―売却者が取引の継続を選択した場合、売却者は実際の注文金額で取引をし、注文を完了する権利があります。―売却者が注文のキャンセルを選択した場合、売却者は支払いを受け取ってから30分以内に返金をして、仮想通貨資産は売却者に返却されます。',
  ],
  table_1_td_10: [
    '10',
    '購入者が「支払い済み」をクリックした後、売却者は1時間以内に支払いを受け取りませんでした',
    '1）売却者は取引を継続するか、返金後に注文のキャンセルをするかの選択をする権利があります。―売却者が取引の継続を選択した場合、売却者は支払い金額を受け取ってから10分以内にリリースを完了する必要があります。―売却者が注文のキャンセルを選択した場合、売却者は支払いを受け取ってから30分以内に返金をして、仮想通貨資産は売却者に返却されます。 2）売却者は広告の発行者であり、苦情後10分以内に購入者に連絡ができなく、売却者が支払いを受け取っていないことを確認した後、担当の専門員は優先して広告主の保証資産の範囲内で注文をキャンセルします。 ',
  ],
  table_1_td_11: [
    '11',
    '支払いを受け取った後、売却者の受け取りアカウントは実名の情報を確認できません',
    '1）購入者の支払いアカウントがプラットフォームの実名アカウントと一致していることを確認し、注文の指定された時間内に支払いが完了すると、この注文は正常に取引されます。2）購入者の支払いアカウントがプラットフォームの実名アカウントと一致してないことを確認した時、上記の第6条の措置に従っての処理となります。',
  ],
  table_1_td_12: [
    '12',
    '購入者の支払い後に売却者の受け取りアカウントが異常である場合',
    '1）購入者はアカウントが正常であることを証明できない場合、売却者は、受取アカウントが正常の状態に戻ってから24時間以内に返金をして、プラットフォームはその注文をキャンセルします。 2）購入者は、アカウントが正常であることを証明できた場合、購入者のアカウントに異常がないことを確認した後、注文が成立し、仮想通貨資産は購入者に送る必要があります。 例：売却者がVユーザーであり、仮想通貨資産は保証された資産の範囲内で売却者に返送され、売却者は受取アカウントが正常の状態に戻ってから24時間以内に返金をする必要があります。',
  ],
  table_1_td_13: [
    '13',
    '支払い時の備考：「仮想通貨、BTC、ビットコイン、Huobi フォビ　」などと同様',
    '売却者は取引を継続するか、取引を行わずに返金するかの選択をする権利があります。1）売却者が取引の継続するを選択した場合、売却者は支払い金額を受け取ってから10分以内にリリースを完了する必要があります。2）売却者が取引を行わずに返金するを選択した場合、この注文はキャンセルし、仮想通貨資産は売却者に返却されます。 売却者は60分以内に返金を完了します。仮に売却者のアカウントがこれで凍結された場合、上記の第12条の措置に従って処理となります。',
  ],
  table_1_td_14: [
    '14',
    '購入者のユーザーは、リスク管理システムによって、悪意で低価格の注文を取得したと判断されました',
    '1）購入者が支払いをしなかった場合、プラットフォームは注文をキャンセルして、資産を売却者に返却します。 2）購入者が支払いをした場合、売却者は苦情処理の10分以内に返金処理をする必要があります。プラットフォームは注文のキャンセルをし売却者への資産の返却を支援します。 購入者はこのような行動が2回に達した場合、リスク管理システムは購入者のアカウントの一部の機能を制限します。',
  ],
  table_1_ps: [
    '備考：この規則には売却者の返金またはリリースが含まれおり、売却者が時間内に操作の完了をできなかった場合、システムは売却者のアカウントの一部の機能を制限します。',
    '備考：OTC取引に第三者の電話システムを使用する過程で、言語の争い、侮辱、あざける(皮肉)、またはその他の過激の言語や行動などの状況があった場合は、システムによってアカウントの一部の機能が制限されます。',
  ],

  // Table #2 Th
  table_2_th: ['#', '例外処理', '処理対策'],

  // Table #2 Td
  table_2_td_1: [
    '1',
    '売却者は、注文の詳細ページに表示される受取アカウント、および注文チャットによって送信された受取アカウントに対して全責任を負います。',
    '売却者が提供する受取アカウントは本人の所有ではない、他人に案内されて他人の受取アカウントを紐付けた、チャットに他人のアカウント情報を送信した場合、購入者の支払い後、資産判定は購入者に属します。',
  ],
  table_2_td_2: [
    '2',
    '注文成立後、注文価格に異議があります。',
    '購入者が注文価格の交渉に同意することを除いて、注文は正常に成立すると、売却者が注文の指定された時間内に注文をリリースする必要があります。',
  ],
  table_2_td_3: [
    '3',
    '売却者から提供された受取アカウントが異常である場合',
    '購入者は、取引を継続するか、注文をキャンセルするかの選択をする権利があります。―購入者が取引の継続を選択した場合、購入者が注文で指定された時間内に全額を支払ったことを確認した時、売却者は支払いを受け取った後、注文で指定された時間内にリリースを完了する必要があります。 ―購入者が注文のキャンセルを選択した場合、売却者は返金をして、仮想通貨資産は売却者に返却されます。',
  ],
  table_2_td_4: [
    '4',
    '売却者が有効な支払い方法を時間内に提供できなかった時、それで購入者が支払いを完了できなく、注文がキャンセルされた場合',
    '売却者が支払い方法を提供していないため、この注文は成立できません。プラットフォームが苦情を処理する時、注文を直接キャンセルした上、売却者ユーザーは罰せられます。プラットフォームによる注文のキャンセルは、購入者の当日のキャンセル回数のカウントに入りません。',
  ],
  table_2_td_5: [
    '5',
    '売却者(広告主以外)は、本人の実名と一致する有効な受け取り情報を紐付いていないか、プラットフォームの実名と一致しない受け取り方法を購入者に提供した時例：AlipayまたはWeChatによる支払いを受け取る場合、アカウントまたは受取人のQRコードの名前が注文詳細ページに表示されている受取人の名前と一致してない時',
    '1）プラットフォームに苦情を申し込む。2）売却者が3回苦情を申し立てられた場合、システムは売却者のアカウントを永遠に制限します。 購入者は取引の継続を選択し、苦情が2回に達した場合、システムは購入者のアカウントの一部の機能を制限します。',
  ],
  table_2_td_6: [
    '6',
    '売却者は、購入者のプラットフォーム以外の実名と一致するアカウントから支払いを受け取り、取引を拒否しなかった場合',
    '1）これにより生じたリスクは、売却者自らの負担となります。 2）これにより苦情の申し立てられた場合は、システムにより売却者のアカウントの一部の機能を制限します。',
  ],
  table_2_td_7: [
    '7',
    '購入者が全額を支払った後に、「支払い済み」をチェックします、売却者が購入者から全額を受け取った後、20分以内にリリースを完了していません。',
    '購入者は、取引を継続するか、注文をキャンセルして返金するかの選択をする権利があります。―購入者は取引の継続を選択した場合、担当の専門員は資産を購入者に属していると判定します。 ―購入者が注文をキャンセルして返金するの選択をした場合、売却者は30分以内に返金を完了する必要があります。 例：購入者が支払いをチェックしてから20分以内に苦情をクリックしますと、売却者はそれによりリリースができず、チャットで購入者と連絡できない場合、この注文は正常に成立となります。',
  ],
  table_2_ps:
    '備考：OTC取引に第三者の電話システムを使用する過程で、言語の争い、侮辱、あざける(皮肉)、またはその他の過激の言語や行動などの状況があった場合は、システムによってアカウントの一部の機能が制限されます。',

  // Table #3 Th
  table_3_th: ['#', 'リスク管理の異常が起きた', '処理対策'],

  // Table #3 Td
  table_3_td_1: [
    '1',
    '利用者がリスク管理システムによって異常を検出された際、プラットフォームのリスク管理に必要となるマネーロンダリング防止検証作業の要求を明確に拒否または積極的に協力しない場合',
    '本プラットフォームは、このアカウントが異常であることを直接認定することを選択し、これに対しリスク管理の証拠資料が提供されるまで、利用者のリスクレベルを上げ、プラットフォームのリスク管理が検証し合格するまで、そのようなユーザーのアカウントおよび関連するアカウントを直接凍結するなどの対策を講じる権利があります。',
  ],
  table_3_td_2: [
    '2',
    'ユーザーがJP88.asia OTCから仮想通貨を購入し、利益やその他のリスクの高い行動のために、他のプラットフォームに販売することが確認された場合。',
    '本プラットフォームは、状況に応じて、出金の遅延、取引の制限、アカウントの凍結など、さまざまな処分措置を受けることを選択する権利があります。注：このような行動が発見され、進行中の注文がある場合、広告主は取引を行わないことを選択する権利があります。',
  ],
  table_3_td_3: [
    '3',
    'アカウントが本人に利用されていない或いは他人に代わりに通貨を購入：プラットフォームのリスク管理でアカウントが販売、貸与、リースと他人に使用されている状況、または他人に代わり通貨を購入する行為が確認された場合。リスクリマインダー：お客様自身の情報セキュリティに注意し、犯罪行為を行うために他人に悪用されないようにしてください。',
    '本プラットフォームは、OTC取引の一時的または永久的な制限、出金の遅延、制限、またはそのようなユーザーのアカウントと関連アカウントの直接凍結などとこれ一つまたはさまざまなの対策を選択する権利があります。 注：このような行動が発見され、進行中の注文がある場合、広告主は取引を行わないことを選択する権利があります。',
  ],
  table_3_td_4: [
    '4',
    'プラットフォームに別のユーザーで利用してテストする：ユーザーが注文なしに、プラットフォームの他のユーザーに少額の支払いをし、その動作を合理的に説明できない場合。',
    '本プラットフォームは、OTC取引の一時的または永久的な制限、出金の制限、アカウントの凍結などとこれ一つまたはさまざまなの対策を選択する権利があります。 ',
  ],
  table_3_td_5: [
    '5',
    '違法なソースからの仮想通貨資産或いは資金の受け取りまたは導入：ユーザーが他のプラットフォーム/ WeChatグループで受け取った通貨がブラック通貨または資金がブラックマネーであることをユーザーが知っていて、または合理的な常識に基づいて判断し、リスクを無視してプラットフォームの他のユーザーのアカウントに直接ブラック通貨/ブラックマネーを流し込んだ場合。',
    '本プラットフォームは、直接このようなユーザーのアカウントおよび関連するアカウントのすべての機能を永久的に制限します。',
  ],
  table_3_td_6: [
    '6',
    'マネーロンダリングとして識別されたユーザー：ユーザーがリスク管理システムによって検証され、リスク管理スタッフによって検証されると、ユーザーはマネーロンダリングなどの犯罪行為に直接参加または協力した場合',
    '本プラットフォームは、直接このようなユーザーのアカウントおよび関連するアカウントのすべての機能を直接に永久的に制限します。',
  ],
  table_3_td_7: [
    '7',
    '司法凍結：司法当局によりユーザーアカウントの凍結を要求された場合。',
    '本プラットフォームは、司法当局によって提示された司法通信に厳密に従って、ユーザーアカウントを凍結します。 凍結期間が満了すると、司法は更新書を提示しますと凍結を継続することができます。 凍結中、ユーザーはプラットフォームに解凍無効の申請をし、凍結機関に連絡して調整してください。',
  ],
  table_3_td_8: [
    '8',
    '司法調査：司法当局により本プラットフォームにユーザーのアカウント情報を要求され、司法調査、相談、その他の形式を含むがこれらに限定されません。',
    '本プラットフォームは、状況に応じて、このようなユーザーのアカウントおよび関連するアカウントの一部の機能を制限します。',
  ],

  // ========
  //   Utils
  // ========
  // Form Label
  understand_agreement: '契約内容を理解しました',
  e_wallet: '電子マネー',
  choose_e_wallet: '*電子マネーを選択してください',

  // No Data
  no_data: 'まだ情報はありません',
  no_data_2: 'データはありません',

  // No Order
  no_order: '注文が存在しません',
  no_order_buy: '買い',
  no_order_sell: '売り',

  // Alert text
  no_token: 'Token(トークン)なし',
  cancel_fail: '注文のキャンセルに失敗しました',

  // Button Text
  btn_continue: '続ける',
  btn_confirm: '確定',
  btn_return: '戻る',
  btn_pair_start: '送信',
  btn_pairing: 'ペアリング接続中',
  btn_loading: '処理中',
  btn_already_pay: '支払いが完了しました',
  btn_cancel_order: '注文をキャンセル',
  btn_over_time: 'タイムアウトしました',
  btn_copy: 'コピー成功',
  btn_copy_fail: 'コピー失敗、手動でコピーしてください',
  btn_back_home: 'ホームページに戻る',
  btn_transaction_detail: '詳細なトランザクション',
  btn_confirm_cancel: '注文のキャンセルを確定',
  btn_fetch_all: '残高を全部引き出す',
  btn_next: '次へ',
  btn_buyer_already_pay: '購入者は支払いました、確認し支払いの受け取りをしてください',
  btn_preparing: '相手は用意中です',
  btn_close: '閉じる',
  btn_detail: '詳細',
  btn_instant: 'リアルタイム取引',
  btn_login: 'ログイン',
  btn_forget_password: 'パスワード忘れ',
  btn_send_valid_code: '認証コードを送信します',
  btn_valid_code_already_send: '確認コードが送信されました',
  btn_back_to_login: 'ログインページに戻る',

  btn_bank: '銀行カード',
  btn_aliPay: 'アリペイ',

  // WelCome Text
  welcome_text: 'ようこそ',

  // ExRate Text
  exRate: '為替レート',
  payment_contact: '支払い窓口',
  limit: '限度額',
  payment_contact_time: '15分',

  // Dialog
  please_wait: '少々お待ちください、現在は取引者の情報を統合しています',
  buy_order: '注文を購入',

  // ========
  //   User
  // ========
  // Navigation
  nav_transaction: '取引',
  nav_history: '記録',
  nav_wallet: 'ウォレット',
  nav_logout: 'ログアウト',
  nav_logout_alert: 'ログアウトしてもよろしいですか？',

  // Balance
  balance_avb: '出金可能額',
  balance_real: '残高',

  // Over View
  overView_transaction: '売買',
  overView_transfer: '振込',
  overView_wallet: 'マイウォレット',
  overView_history: '決済履歴',

  // Slogan
  slogan_title: '最も信頼できる仮想通貨取引所',
  slogan_sub_text_1: 'いくつかの簡単なステップで自分のウォレットを作成する事ができます',
  slogan_sub_text_2: '仮想通貨を安全に売買し、取引することができます!!',

  // Transaction Navigation
  transaction_nav_buy: '購入',
  transaction_nav_sell: '売却',
  transaction_nav_transfer: '振込',

  // =========
  //  Balance
  // =========
  // Error Text
  avb_insufficient: '出金可能額が不足してます',
  avb_over_limit: '最大の出金可能額を超えています',

  // ======
  //  Buy
  // ======
  buy_usdt: 'USDTを購入します',

  // Error Text
  no_account_name: 'カードの所有者の名前を入力する必要があります',
  invalid_number: '有効な購入数量を入力してください',

  // Form Text
  please_enter_quantity: '購入数量を入力してください',
  account_name_placeholder: '振込名義人',
  account_name_prompt: '*振込銀行のカード名義人の実名を入力してください',
  buy_total: '合計金額',
  buy_quantity: '数量',

  // Buy Info Header
  transfer_data: '振込情報',
  limit_time: '残りの支払い時間',

  // Buy Detail
  amount: '支払い金額',
  payee: '受取人名',
  payee_account: '支払口座',
  bank: '口座開設銀行',
  city: '所在地',

  // =======
  //  Sell
  // =======
  // Sell Pairing
  pair_title: 'しばらくお待ちください、ただ今取引者の情報を統合しています',
  pair_text: '売却注文',

  // Sell ExRate
  sell_usdt: 'USDTを販売',

  // Sell Error Text
  sell_invalid_number: '有効な数量を入力してください',
  sell_error_enter_payee: '受取人名を入力してください',
  sell_error_enter_bank: '口座開設銀行を入力してください',
  sell_error_enter_payee_account: '受取口座を入力してください',
  sell_error_enter_city: '所在地を入力してください',

  // Sell Form
  sell_enter_qua: '販売数量を入力してください',

  // Sell Bank Form
  sell_payee: '受取人名',
  sell_payee_account: '受取口座',
  sell_bank: '口座開設銀行',
  sell_city: '所在地',

  // Sell Header
  sell_info_transfer_data: '振込情報',
  sell_info_limit_time: '残りの支払い時間',

  // Sell Detail
  sell_over_time: '取引がタイムアウトしました',
  sell_detail_amount: '受取金額',
  sell_detail_payee: '受取人名',
  sell_detail_payee_account: '支払口座',
  sell_detail_payee_bank: '口座開設銀行',
  sell_detail_payee_city: '所在地',

  // ==========
  //  Transfer
  // ==========
  // Error Text
  transfer_address_error: 'ウォレットアドレスが間違っています',
  transfer_error_invalid_number: '有効な数量を入力してください',

  // Transfer Header
  select_protocol: '仮想通貨を選んでください',
  protocol_trc20: 'TRC20',
  protocol_erc20: 'ERC20',
  transfer_charge: '手数料',
  transfer_title: 'USDTを振込します',
  transfer_address: '振込アドレス',
  open_camera: 'カメラでQRコードをスキャンしますか？',

  // Transfer Info
  transfer_info_success: '取引成功',
  transfer_info_address: '振込アドレス',
  transfer_info_hash: 'トランザクションID',
  transfer_info_loading: '振込中',
  transfer_info_fail: '振込失敗',

  // Transfer Loading
  transfer_onLoading: '執行中、しばらくお待ちください',
  transfer_text: '振込',

  // Transfer Form
  transfer_enter_number: '数量を入力してください',
  transfer_enter_address: '受取アドレスを入力してください',

  // Complete State
  wait_confirm: '送信済み、確認待ち',
  transaction_hash: '取引確認',
  complete_text: '購入が成功しますと、仮想通貨は15〜30分以内にお客様のウォレットアドレスに着金される予定です',
  transaction_done: '取引が完了しました',
  transaction_cancel: '取引がキャンセルされました',
  transaction_over_time: '取引がタイムアウトしました',

  // Cancel Order Component
  cancel_component_title: '注文をキャンセルしてもよろしいですか？',
  order_number: '注文番号',

  // Form Footer
  form_footer_text_1: '本プラットフォームは現在USDTのみを提供し、他の仮想通貨は受け入れられません。',
  form_footer_text_2: 'このプラットフォームのウォレットアドレスの入金または出金は、USDTブロックチェーンシステムを介して確認されます。',
  form_footer_text_3:
    '本プラットフォームのウォレットアドレスは、入金または出金を繰り返し使用することができます。システムが更新された場合は、Webサイトまたはメッセージでお知らせします。',
  form_footer_text_4:
    'USDT以外の仮想通貨を当社のウォレットアドレスに入金しないでください。入金した場合は、お客様の資産の取り返しはできませんので、ご注意ください。',
  form_footer_text_5: '最低入金額：100USDT、最低額未満の入金はアカウントに入金されず、返金できません。',
  form_footer_text_6: '情報の改ざんや漏洩を防ぐため、パソコンやブラウザのセキュリティを必ずご確認ください。',
  form_footer_text_7: 'その他の質問や紛争の要件がある場合、Webサイトのカスタマーサポートにご連絡ください。',

  // ==========
  //  History
  // ==========
  // History nav
  history_all: '全ての記録',
  history_wait: '保留中',
  history_date: '日付',
  history_transaction_deal: '取引金額(USDT)',
  history_transaction_real: '残高(USDT)',
  history_transaction_status: '状態',
  history_transaction_complete: '完了',
  history_previousLabel: '前のページ',
  history_nextLabel: '次のページ',

  // History All Detail
  history_buy: '購入',
  history_sell: '売却',
  history_transfer_in: '入金',
  history_transfer_out: '出金',
  history_transaction_hash: '取引確認',
  history_transaction_charge: '手数料',
  history_transaction_price: '為替価格',
  history_RMB: 'RMB(中国ドル)',
  history_currency: 'JPY(日本)',
  history_account: 'アカウント',
  history_payee: '受取人',
  history_bank: '銀行',
  history_branch: '支店',

  // History Wait
  history_wait_pay: '支払い待ち',
  history_account_receivable: '入金確認中',
  history_onGoing: '実行中',

  // ==========
  //  Wallet
  // ==========
  wallet_address: '入金アドレス',

  // ==========
  //  Chat
  // ==========
  chat_help: 'ヘルプ',
  chat_sound_open: '通知音がオンになりました',
  chat_sound_close: '通知音がオフになりました',
  chat_order_number: '注文番号',
  chat_customer_server: 'カスタマーサポート',
  chat_send_message: '会話',

  // ==========
  //  Instant
  // ==========
  instant_transaction: ' 即時売買',
  instant_sound_open: '通知音がオンになりました',
  instant_sound_close: '通知音がオフになりました',
  instant_over_time: '取引がタイムアウトしました',
  instant_over_time_short: 'タイムアウトしました',

  // Instant Nav
  instant_nav_all: '即時売買',
  instant_nav_onGoing: '進行中',

  // Instant All Item && Instant Count
  instant_exRate: '為替レート',
  instant_price: '合計金額',
  instant_qua: '数量',
  instant_acc_time: '累計時間',
  instant_limit_time: '制限時間',
  instant_buy: '購入',
  instant_pay: '支払う',
  instant_sell: '売却',
  instant_get: '受取',
  instant_no_transaction: '現在は取引がありません',

  // Instant Buy Detail
  instant_payee_data: '受取人情報',
  instant_pay_time: '残りの支払い時間',
  instant_payee_name: '受取人名',
  instant_payee_account: '受取人口座',
  instant_bank: '口座開設銀行',
  instant_city: '所在地',
  instant_payer_data: '支払人情報',
  instant_payer_name: '支払人名',

  // ==========
  //  Auth
  // ==========
  // Index
  auth_login: 'アカウントにログイン',
  auth_register: '新規登録',
  auth_nav_login: 'ログイン',
  auth_nav_register: '登録',
  register_success: '登録成功',

  // Alert Text
  alert_text_1: '*ボタンをクリックしますと、1回限りの認証コードを送信します',

  // Error Text
  no_countryCode: '国番号を選択してください',
  invalid_phoneNumber: '有効な電話番号を入力してください',
  invalid_password: 'パスワードは英語と数字のみで、6桁以上にする必要があります',
  confirm_password_fail: '1回目のパスワードと一致しておりません',
  no_account: 'このアカウントは登録されておりません',
  captcha_error: '認証コードが間違っています',

  // Form Input
  countryCode: '国番号',
  china: '中国＋86',
  taiwan: '台湾＋886',
  singapore: 'シンガポール＋65',
  malaysia: 'マレーシア＋60',
  hk: '香港＋852',
  jp: '日本+81',

  // Placeholder
  phoneNumber: '携帯電話番号',
  password: 'パスワード',
  enter_valid: '認証コードを入力します',
  enter_password: 'パスワードを設定します',
  enter_new_password: '新しいパスワードを入力します',
  enter_confirm_password: 'パスワードを確認します',
  captcha_check: '認証コードは大文字と小文字の区別があります',

  // Label
  read_and_agree: '読んだ上、同意します',
  user_agreement: '《利用規約》',
  click_and_send_valid_code: 'ボタンをクリックしますと、認証コードを送信します',
  one_time_code: '1回限りの認証コード',

  // 貨幣種類
  currency: 'JPY',

  // 中國區提示
  china_area_alert_1: 'ご注意ください！',
  china_area_alert_2:
    'お住まいの地域は当地の電気通信規制により制限されているため、システムからの送信に時間がかかる場合があります。しばらくお待ちいただくか、もう一度お申し込みをしてください。 それでも問題が解決しない、またはその他の問題がある場合は、サポートを提供する担当者のカスタマーサービスのWeChatアカウントにご連絡ください。 WeChatアカウント：238bien',

  // ===========
  //  Http Text
  // ============
  login_again: 'もう一度ログインしてください',
  set_password_success: 'パスワードの設定に成功しました',
  password_changed: 'パスワードは変更されました',
  http_error_code_1: 'システムエラー',
  http_error_code_10: 'アカウントまたはパスワードが間違っています',
  http_error_code_11: 'このアカウントはすでに登録されています',
  http_error_code_12: 'このアカウントは登録できません',
  http_error_code_13: 'jsonフォーマットが間違っています',
  http_error_code_14: 'jsonフォーマットが間違っています',
  http_error_code_15: '無効なトークン(token)',
  http_error_code_16: '間違った操作です',
  http_error_code_17: 'アカウントが登録されていません',
  http_error_code_20: 'データのフォーマットが間違っています',
  http_error_code_21: 'リクエストを連続的に送信しないでください',
  http_error_code_22: '認証コードが間違っています',
  http_error_code_30: '無効なウォレットアドレス',
  http_error_code_31: '自分に送金することはできません',
  http_error_code_32: '出金可能額が不足しています',
  http_error_code_91: 'セッションがタイムアウトしましたので、もう一度ログインしてください',
  http_error_other: 'エラーが発生しました。もう一度ログインして、お試しください',
};
